Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ХарактеристикиНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтечественныйНеподакцизныйТовар</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураГТД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураГТД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬКодУКТВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторУКТВЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодНК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/КомплектующиеНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КомплектующиеНоменклатуры</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляСтоимости</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комплектующая</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаКомплектующей</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ГруппыХарактеристик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ГруппыХарактеристик</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспаковатьРостовок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИгнорироватьНоль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыгружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОсновная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПошиваНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПошиваКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Характеристики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ГруппаЦветов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ГруппаЦветов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Характеристики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Фотографии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Фото</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Главная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеВыгружать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеWebp</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеВыгружатьРозница</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеВыгружатьОпт</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СхемыРезервирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СхемыРезервирования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Склады</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ХарактеристикиНоменклатуры/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ)

	Если НЕ ОбменДанными.Загрузка
	   И НЕ Владелец.ВестиУчетПоХарактеристикам Тогда
		//ОбщегоНазначения.СообщитьОбОшибке(
		//"Для номенклатуры """ + Владелец + """ не ведется учет по характеристикам.
		//|Характеристика """ + Наименование + """ не может быть записана.", 
		//Отказ);

	КонецЕсли;
	
	
	Если Не ЗначениеЗаполнено(ОбщегоНазначения.УбратьНоликиСлева(Код)) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		               |ГДЕ
		               |	НЕ ХарактеристикиНоменклатуры.ПометкаУдаления
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ХарактеристикиНоменклатуры.Код УБЫВ";
		Рез = Запрос.Выполнить().Выбрать();
		
		Если Рез.Следующий() Тогда
			ПослКод= Число(Рез.Ссылка.Код);
		Иначе
			ПослКод = 0;
		КонецЕсли;
		ПослКод = ПослКод+1;
		Код = ОбщегоНазначения.ДополнитьНомерНулями(ОбщегоНазначения.НормальноеЧисло(ПослКод),9);
	КонецЕсли;
	

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
		
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("СвойстваИЗначения") Тогда
		
		ОбработкаОбъект = Обработки.ЗначенияСвойствОбъекта.Создать();
		
		ОбработкаОбъект.ОбъектОтбораЗначений = Ссылка;
		
		ОбработкаОбъект.СвойстваИЗначения.Загрузить(ЭтотОбъект.ДополнительныеСвойства.СвойстваИЗначения);
		
		Отказ = Не ОбработкаОбъект.ЗаписатьЗначенияСвойств();
	КонецЕсли;
	
	ТаблицаИДГрупп = Константы.ТаблицаИД.Получить().Получить();
	
	Если ТипЗнч(ТаблицаИДГрупп) <> Тип("ТаблицаЗначений") Тогда
		
		ТаблицаИДГрупп = Новый ТаблицаЗначений;
		
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	
	Если ЦветХарактеристики() = Неопределено Или
		 ЦветХарактеристики() = "" 
		Тогда
		 Возврат;
	КонецЕсли;
	
	ПараметрыОтбора.Вставить("Характеристика", Ссылка);
	ПараметрыОтбора.Вставить("Код"           , Ссылка.Владелец.Код);
	ПараметрыОтбора.Вставить("Цвет"          , ЦветХарактеристики());
	ПараметрыОтбора.Вставить("Ткань"         , ОбщегоНазначения.ТканьХарактеристики(Ссылка));
	ПараметрыОтбора.Вставить("Подкладка"     , ОбщегоНазначения.ПодкладкаХарактеристики(Ссылка));
	
	НайденныеСтроки = ТаблицаИДГрупп.НайтиСтроки(ПараметрыОтбора);

	Дубль = 3098;
	Дубль1 = 3096;
	
	 Если НайденныеСтроки.Количество() = 0 Тогда // Или Ид = Дубль Или Ид = Дубль1 Тогда //
				
		НайденныеСтроки = ТаблицаИДГрупп.НайтиСтроки(Новый Структура("Характеристика", Ссылка));
		
		Если НайденныеСтроки.Количество() = 0 Тогда                                                                   			
			СтрокаТЗ = ТаблицаИДГрупп.Добавить();
			
		Иначе
			
			СтрокаТЗ = НайденныеСтроки[0];
			
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтрокаТЗ, ПараметрыОтбора);
		
		СтрокаТЗ.Владелец = Ссылка.Владелец;
		
		ПараметрыОтбора.Удалить("Характеристика");
		
		НайденныеСтроки = ТаблицаИДГрупп.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеСтроки.Количество() = 0 Или НайденныеСтроки[0].Цвет = "" Тогда
			
			Если ТаблицаИДГрупп.Количество() > 0 Тогда
				
				ТаблицаКопия = ТаблицаИДГрупп.Скопировать();
				
				ТаблицаКопия.Сортировать("ИД Убыв");
				
				СтрокаТЗ.ИД = ТаблицаКопия[0].ИД + 1;
				
			Иначе                                                                      
				
				СтрокаТЗ.ИД = 1;
				
			КонецЕсли;
			
		Иначе
			
			Если НайденныеСтроки[0].ИД = 0 Тогда // Или ИД = Дубль ИЛИ Ид = Дубль1 Тогда   
		
				
				Если ТаблицаИДГрупп.Количество() > 0 Тогда
					
					ТаблицаКопия = ТаблицаИДГрупп.Скопировать();
					
					ТаблицаКопия.Сортировать("ИД Убыв");
					
					ИД = ТаблицаКопия[0].ИД + 1;
					
				Иначе
					
					ИД = 1;
					
				КонецЕсли;
				
				Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					
					НайденнаяСтрока.ИД = ИД;
					
				КонецЦикла;
				
			КонецЕсли; //
			
			СтрокаТЗ.ИД = НайденныеСтроки[0].ИД;


		КонецЕсли;
		
		Константы.ТаблицаИД.Установить(Новый ХранилищеЗначения(ТаблицаИДГрупп));
	Иначе 
		
		//ТаблИД = НайденныеСтроки[0].ИД;

	КонецЕсли;   //
	
	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТИРУЕМЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Функция устанавливает новое наименование характеристики по значениям свойств.
//
// Параметры:
//  КоллекцияЗначенийСвойств - коллекция значений, имеющая свойство Значение.
//
// Возвращаемое значение:
//  Строка - сформированное наименование.
//
Функция СформироватьНаименование(КоллекцияЗначенийСвойств) Экспорт

	Строка = "";

	Для каждого ЭлементКоллекции Из КоллекцияЗначенийСвойств Цикл
		
		Если ЗначениеЗаполнено(ЭлементКоллекции.Значение) Тогда
			
			Если ТипЗнч(ЭлементКоллекции.Значение) = Тип("Дата") Тогда
				
				Если ЭлементКоллекции.Свойство.ТипЗначения.КвалификаторыДаты.ЧастиДаты = ЧастиДаты.Дата Тогда
					Строка = Строка + Формат(ЭлементКоллекции.Значение, "ДФ=dd.MM.yyyy") + ", ";
				ИначеЕсли ЭлементКоллекции.Свойство.ТипЗначения.КвалификаторыДаты.ЧастиДаты = ЧастиДаты.Время Тогда
					Строка = Строка + Формат(ЭлементКоллекции.Значение, "ДФ=ЧЧ:мм:сс") + ", ";
				Иначе
					Строка = Строка + ЭлементКоллекции.Значение + ", ";
				КонецЕсли;
				
			Иначе
				
				Строка = Строка + ЭлементКоллекции.Значение + ", ";
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;

	Строка = Лев(Строка, СтрДлина(Строка) - 2);

	Если ПустаяСтрока(Строка) Тогда
		Строка = "<Свойства не назначены>";
	КонецЕсли;

	Возврат Строка;

КонецФункции

функция ПолучитьКодыСвойств() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СвойстваОбъектов.Код КАК Код
	|ИЗ
	|	ПланВидовХарактеристик.СвойстваОбъектов КАК СвойстваОбъектов
	|ГДЕ
	|	СвойстваОбъектов.НазначениеСвойства.Код = ""000000103"" ";
		
	Рез = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Код");
	
	Возврат Рез 
	
конецФункции

Функция СвободныйОстаток(Склад) Экспорт  
	Если ЭтоНаборКомплектРучной() Тогда  
		
		
		Склады = Новый Массив;
		Запрос = Новый Запрос(ОбщегоНазначения.ПолучитьЗапросДляНаборКомплект());   
		Запрос.УстановитьПараметр("НаДату"                           , ТекущаяДата());
		Запрос.УстановитьПараметр("Номенклатура"                     , Владелец);
		Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры"       , Ссылка);
		Запрос.УстановитьПараметр("ХарактеристикаНоменклатурыВыбрана", СокрЛП(Ссылка) = "<без характеристики>");
		Запрос.УстановитьПараметр("Склад"                            , Склады);
		Запрос.УстановитьПараметр("СкладнеВыбран"                    , Истина);		
		Рез = Запрос.Выполнить().Выгрузить();
		
		Возврат Рез.Итог("Остаток");
	Иначе
		Возврат Остаток(Склад) - Резерв(Склад);	
	КОнецесли;
КонецФункции

Функция Остаток(Склад) Экспорт 
		
	Возврат ОбщегоНазначения.ОстатокНоменклатуры(Владелец, Склад, Ссылка, ТекущаяДата());
		
КонецФункции

Функция Резерв(Склад) Экспорт 
			
	Возврат ОбщегоНазначения.РезервНоменклатуры(Владелец, Склад, Ссылка,ТекущаяДата());
			
КонецФункции

Функция Комплектующие_НК() Экспорт // 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КомплектующиеНоменклатуры.Комплектующая КАК Комплектующая,
	               |	КомплектующиеНоменклатуры.ХарактеристикаКомплектующей КАК ХарактеристикаКомплектующей,
	               |	КомплектующиеНоменклатуры.Количество КАК Количество,
	               |	КомплектующиеНоменклатуры.Номенклатура КАК Номенклатура,
	               |	КомплектующиеНоменклатуры.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	               |ИЗ
	               |	РегистрСведений.КомплектующиеНоменклатуры КАК КомплектующиеНоменклатуры
	               |ГДЕ
	               |	КомплектующиеНоменклатуры.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры";
	
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",Ссылка);
	
	Рез = Запрос.Выполнить().Выгрузить();
	
	Возврат Рез;
	
КонецФункции

Функция ХарактеристикаРостовки() Экспорт 

	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика,
	               |	ВЫБОР
	               |		КОГДА основная.Ссылка ЕСТЬ NULL
	               |			ТОГДА неосновная.Ссылка
	               |		ИНАЧЕ основная.Ссылка
	               |	КОНЕЦ КАК Ростовка
	               |ПОМЕСТИТЬ ВТРостовка
	               |ИЗ
	               |	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	               |		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			МАКСИМУМ(ГруппыХарактеристикХарактеристики.Ссылка) КАК Ссылка,
	               |			ГруппыХарактеристикХарактеристики.Характеристика КАК Характеристика
	               |		ИЗ
	               |			Справочник.ГруппыХарактеристик.Характеристики КАК ГруппыХарактеристикХарактеристики
	               |		ГДЕ
	               |			ГруппыХарактеристикХарактеристики.Ссылка.НеОсновная
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ГруппыХарактеристикХарактеристики.Характеристика) КАК неосновная
	               |		ПО ХарактеристикиНоменклатуры.Ссылка = неосновная.Характеристика
	               |		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			МАКСИМУМ(ГруппыХарактеристикХарактеристики.Ссылка) КАК Ссылка,
	               |			ГруппыХарактеристикХарактеристики.Характеристика КАК Характеристика
	               |		ИЗ
	               |			Справочник.ГруппыХарактеристик.Характеристики КАК ГруппыХарактеристикХарактеристики
	               |		ГДЕ
	               |			НЕ ГруппыХарактеристикХарактеристики.Ссылка.НеОсновная
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ГруппыХарактеристикХарактеристики.Характеристика) КАК основная
	               |		ПО ХарактеристикиНоменклатуры.Ссылка = основная.Характеристика
	               |ГДЕ
	               |	ХарактеристикиНоменклатуры.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПолучимХарактеристикуНк.Ссылка КАК ХарактеристикаНк
	               |ИЗ
	               |	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРостовка КАК ВТРостовка
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ПолучимХарактеристикуНк
	               |			ПО ВТРостовка.Ростовка.Наименование = ПолучимХарактеристикуНк.Наименование
	               |				И (ВТРостовка.Характеристика.Владелец.Код = ПолучимХарактеристикуНк.Владелец.Нк
	               |					ИЛИ ПолучимХарактеристикуНк.Владелец.ГруппаХарактеристик.Владелец = ВТРостовка.Характеристика.Владелец)
	               |		ПО ХарактеристикиНоменклатуры.Ссылка = ВТРостовка.Характеристика
	               |ГДЕ
	               |	ХарактеристикиНоменклатуры.Ссылка = &Ссылка";
	
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
        Возврат Выборка.ХарактеристикаНк; // вернём сразу ссылку
	КонецЕсли;
	Попытка
		Форма = ПолучитьРостовку().ПолучитьОбъект().ПолучитьФорму("ФормаЭлемента");
		Форма.Открыть();
	Исключение
	КонецПопытки;
		
    Возврат неопределено;
		
КонецФункции

функция ЭтоХарактеристикаНК() Экспорт
	Возврат Владелец.ВидНоменклатуры.Код = "000000009"  ; 
КонецФункции    

функция ЭтоХарактеристикаРучнойНК() Экспорт
	Возврат Владелец.ВидНоменклатуры.Код = "000000010"  ; 
КонецФункции 


Функция ПолучитьРостовки(ПроверятьОсновную = Ложь) Экспорт
	Если ЭтоХарактеристикаНК() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =     "ВЫБРАТЬ
		                   |	ГруппыХарактеристикХарактеристики.Ссылка КАК Ссылка
		                   |ИЗ
		                   |	Справочник.ГруппыХарактеристик.Характеристики КАК ГруппыХарактеристикХарактеристики
		                   |ГДЕ
		                   |	(ГруппыХарактеристикХарактеристики.Ссылка.Владелец.Код = &Код
		                   |			ИЛИ ГруппыХарактеристикХарактеристики.Ссылка.Владелец.Код = &КодВладельца)
		                   |	И ГруппыХарактеристикХарактеристики.Ссылка.Наименование = &Наименование";
		
		Запрос.УстановитьПараметр("Код",Владелец.Нк);
		Запрос.УстановитьПараметр("КодВладельца",Владелец.ГруппаХарактеристик.Владелец.Код);
		Запрос.УстановитьПараметр("Наименование",Наименование);	
		
		Возврат Запрос.Выполнить().Выгрузить();	
		
	Иначе 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ГруппыХарактеристикХарактеристики.Ссылка.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.ГруппыХарактеристик.Характеристики КАК ГруппыХарактеристикХарактеристики
		               |ГДЕ
		               |	ГруппыХарактеристикХарактеристики.Характеристика = &Характеристика"; 
					   
		Если ПроверятьОсновную Тогда  
			
			Запрос.Текст = Запрос.Текст + " 
				 |	И НЕ ГруппыХарактеристикХарактеристики.Ссылка.НеОсновная";  
		КонецЕсли;
		              		
		Запрос.УстановитьПараметр("Характеристика",Ссылка);
		
		Рез = Запрос.Выполнить().Выгрузить();  
		
		Если Рез.Количество() <> 0 Тогда
			Возврат Рез;	
		Иначе      
			Если ПроверятьОсновную Тогда
				Возврат ПолучитьРостовки();
			Иначе 
				Возврат Рез;  
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	

КонецФункции

Функция ПолучитьРостовку(ПроверятьОсновную = Ложь) Экспорт // группа характеристик
	
	Ростовки = ПолучитьРостовки(ПроверятьОсновную);	
	
	Если Ростовки.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Ростовки.Количество() > 1 Тогда
		
		ИндексИгНоль = 0;
		ИндексГруппысИгНоль = 0;
		
		Для Каждого Ростовка Из Ростовки Цикл
			ИндексИгНоль = ИндексИгНоль + 1;
			
			Если Ростовка.Ссылка.ИгнорироватьНоль Тогда
				 ИндексГруппысИгНоль = ИндексИгНоль - 1; 			
			КонецЕсли;
		КонецЦикла;
		
		Если ИндексГруппысИгНоль <> 0 Тогда
			Возврат Ростовки[ИндексГруппысИгНоль].Ссылка;
		КонецЕсли;
		
		Индекс = 0;
		ИндексГруппы = 0;
		КолВоХарИк = 0;
				
		Для Каждого Ростовка Из Ростовки Цикл
			Индекс = Индекс + 1;
			Если КолВоХарИк = 0 Тогда
				КолВоХарИк = Ростовка.Ссылка.Характеристики.Количество();
			Иначе 
				Если КолВоХарИк > Ростовка.Ссылка.Характеристики.Количество() Тогда
					КолВоХарИк = Ростовка.Ссылка.Характеристики.Количество();
					ИндексГруппы = Индекс - 1;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
			
		Возврат Ростовки[ИндексГруппы].Ссылка;
	Иначе
		Возврат Ростовки[0].Ссылка;
	КонецЕсли;	
			
КонецФункции

Функция ПолучитьЗначениеЦвета() Экспорт 
	СвойствоЦвет = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("000000069");
	ТабСвойства = ОбщегоНазначения.СвойстваЗначенияНоменклатураЗн(СвойствоЦвет,Ссылка);
	Сост =        ОбщегоНазначения.СоставныеПоРазделителю(Наименование,",");
	ЦветС = "";
	Для Каждого Стр Из Сост Цикл
		НайденоСвойство = ТабСвойства.Найти(СокрЛП(Стр.Значение),"Наименование");
		Если НЕ НайденоСвойство = Неопределено Тогда
			ЦветС = НайденоСвойство.Значение;
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	
	Если Не ЗначениеЗаполнено(ЦветС) Тогда
		СвойствоЦвет = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("000000072");
		ТабСвойства = ОбщегоНазначения.СвойстваЗначенияНоменклатураЗн(СвойствоЦвет,Ссылка);
		Сост = ОбщегоНазначения.СоставныеПоРазделителю(Наименование,",");
		ЦветС = "";
		Для Каждого Стр Из Сост Цикл
			НайденоСвойство = ТабСвойства.Найти(СокрЛП(Стр.Значение),"Наименование");
			Если НЕ НайденоСвойство = Неопределено Тогда
				ЦветС = НайденоСвойство.Значение;
				Прервать;
			КонецЕсли;
		КонецЦикла;	
	
	КонецЕсли;
	
	Возврат ЦветС;
	
КонецФункции

функция ПолучитьФото() Экспорт 
		Запрос = Новый Запрос;

	Запрос.Текст = 
	
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ГруппаЦветовФотографии.Фото КАК Фото,
		|	ГруппаЦветовФотографии.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ГруппаЦветов.Фотографии КАК ГруппаЦветовФотографии
		|ГДЕ
		|	ГруппаЦветовФотографии.Ссылка В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ГруппаЦветовХарактеристики.Ссылка
		|			ИЗ
		|				Справочник.ГруппаЦветов.Характеристики КАК ГруппаЦветовХарактеристики
		|			ГДЕ
		|				ГруппаЦветовХарактеристики.Характеристика В (&Характеристика))
		|	И ГруппаЦветовФотографии.Главная";
	
	
	Запрос.УстановитьПараметр("Характеристика", Ссылка);
	Рез =  Запрос.Выполнить().Выгрузить();

	Если рез.Количество() > 0 Тогда
	    Возврат рез[0].фото;
	Иначе
	    Возврат Неопределено;
	КонецЕсли;		  
		
КонецФункции

функция ПолучитьКодаЦвета() Экспорт 
	
	Структура = Новый Структура("colorPath, colorCode, color");
	
	ЦвХ = ПолучитьЗначениеЦвета();
	
	Если ТипЗнч(ЦвХ)= Тип("СправочникСсылка.АСБ_ЦветаНоменклатуры") Тогда
		Цв1 = ""; Цв2 = ""; ЦвФ1="";ЦвФ2="";
		Если ЦвХ.ТипЦвета1 = "RGB" Тогда
			Если (ЦвХ.Красный+ЦвХ.Зеленый+ЦвХ.Голубой)>0 Тогда
				Цв1 = ОбщегоНазначения.Код16(ЦвХ.Красный,ЦвХ.Зеленый,ЦвХ.Голубой);
			Иначе
				Цв1="#000000";
			КонецЕсли;
		ИначеЕсли   ЦвХ.ТипЦвета1 = "HEX" Тогда
			Если СокрЛП(ЦвХ.ЦветХекс) = "" Тогда
				Цв1 = "";
			Иначе
				Цв1 = "#"+ЦвХ.ЦветХекс;
			КонецЕсли;
		ИначеЕсли   ЦвХ.ТипЦвета1 = "RAL" Тогда
			Если ЗначениеЗаполнено(ЦвХ.Цвет.Код16) Тогда
				Цв1 = ЦвХ.Цвет.Код16;
			Иначе 
				Цв1 = "";
			КонецЕсли;
		Иначе
			Карт = ЦвХ.ЦветФайл.Получить();
			Если НЕ Карт = Неопределено Тогда
				ЦвФ1 = "http://cvetkovtm.com/assets/shop/sync/imgJpg/color"+ЦвХ.Код+"_1.jpg";
			Иначе
				ЦвФ1 = "";
			КонецЕсли;
		КонецЕсли;
		
		Если ЦвХ.ТипЦвета2 = "RGB" Тогда
			Если (ЦвХ.Красный1+ЦвХ.Зеленый1+ЦвХ.Голубой1)>0 Тогда
				Цв2 = ОбщегоНазначения.Код16(ЦвХ.Красный1,ЦвХ.Зеленый1,ЦвХ.Голубой1);
			Иначе
				Цв2="#000000";
			КонецЕсли;
		ИначеЕсли   ЦвХ.ТипЦвета2 = "HEX" Тогда
			Если СокрЛП(ЦвХ.ЦветХекс1) = "" Тогда
				Цв2 = "";
			Иначе
				Цв2 = "#"+ЦвХ.ЦветХекс1;
			КонецЕсли;
		ИначеЕсли   ЦвХ.ТипЦвета2 = "RAL" Тогда
			Если ЗначениеЗаполнено(ЦвХ.Цвет1.Код16) >0 Тогда
				Цв2 =  ЦвХ.Цвет1.Код16;
			Иначе 
				Цв2 = "";
			КонецЕсли;
		Иначе
			Карт = ЦвХ.ЦветФайл1.Получить();
			Если НЕ Карт = Неопределено Тогда
				ЦвФ2 = "http://cvetkovtm.com/assets/shop/sync/imgJpg/color"+ЦвХ.Код+"_2.jpg";
			Иначе
				ЦвФ2 = "";
			КонецЕсли;
		КонецЕсли;
		
		ИтЦв = "";
		Если НЕ СокрЛП(Цв1)="" Тогда
			ИтЦв = ИтЦв+Цв1;
		КонецЕсли;
		
		Если НЕ СокрЛП(Цв1)="" И НЕ СокрЛП(Цв2)=""  Тогда
			ИтЦв = ИтЦв+"|"+Цв2;
		КонецЕсли;
		
		Если СокрЛП(Цв1)="" И НЕ СокрЛП(Цв2)=""  Тогда
			ИтЦв = Цв2;
		КонецЕсли;
		
		Если  СокрЛП(ИтЦв) = "" Тогда  // просто RAL
			ИтЦв = ЦвХ.Цвет.Код16;
		КонецЕсли;
		
		Структура.colorCode = ИтЦв; 
		
		Если ЗначениеЗаполнено(ЦвФ1) Тогда
			Структура.colorPath = ЦвФ1;	
		КонецЕсли;
		Если ЗначениеЗаполнено(ЦвФ2) Тогда
			Структура.colorPath = ЦвФ2;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ЦвХ) = Тип("СправочникСсылка.ЗначенияСвойствОбъектов") И
		Не ПустаяСтрока(ЦвХ.КодЦвета) Тогда
			 Структура.colorCode = СокрЛП(ЦвХ.КодЦвета);
	КонецЕсли;
	
	Структура.color = СокрЛП(ЦвХ); 	
	
	Возврат Структура;
	
КонецФункции
//Функция ПолучитьЦвет() Экспорт 
//	//Размер
//	СвойствоРазмер = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("000000099");
//	//37 тип изделия
//	ТабСвойства = ОбщегоНазначения.СвойстваЗначенияНоменклатура(СвойствоРазмер,Ссылка);
//	Сост = ОбщегоНазначения.СоставныеПоРазделителю(Наименование,",");
//	РазмерС = "";
//	Для Каждого Стр Из Сост Цикл
//		НайденоСвойство = ТабСвойства.Найти(Стр.Значение,"Значение");
//		Если НЕ НайденоСвойство = Неопределено Тогда
//			РазмерС = Стр.Значение;
//			Прервать;
//		КонецЕсли;
//	КонецЦикла;	
//	Возврат РазмерС;
//КонецФункции

Функция ИдГруппыПолучить() Экспорт
	
	ТаблицаИДГрупп = Константы.ТаблицаИД.Получить().Получить();

	ПараметрыОтбора = Новый Структура;
	
	ПараметрыОтбора.Вставить("Характеристика", Ссылка);
	ПараметрыОтбора.Вставить("Код"           , Владелец.Код);
	ПараметрыОтбора.Вставить("Цвет"          , ЦветХарактеристики());
	ПараметрыОтбора.Вставить("Ткань"         , ОбщегоНазначения.ТканьХарактеристики(Ссылка));
	ПараметрыОтбора.Вставить("Подкладка"     , ОбщегоНазначения.ПодкладкаХарактеристики(Ссылка));

	НайденныеСтроки = ТаблицаИДГрупп.НайтиСтроки(ПараметрыОтбора);
	
	Если НайденныеСтроки.Количество()>0 Тогда
		Возврат Формат(НайденныеСтроки[0].ИД, "ЧГ=0");
	Иначе
	
		//Ссылка.ПолучитьОбъект().Записать();
		Записать();
		ТаблицаИДГрупп = Константы.ТаблицаИД.Получить().Получить();
		НайденныеСтроки = ТаблицаИДГрупп.НайтиСтроки(ПараметрыОтбора);

		Если НайденныеСтроки.Количество()>0 Тогда
			Возврат Формат(НайденныеСтроки[0].ИД, "ЧГ=0");
		Иначе
			Возврат "";
		КонецЕсли
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьКодЦвета() Экспорт 
	Цвет = ОбщегоНазначения.СвойстваОбъекта(Ссылка,"000000069");
	
	Если Не ЗначениеЗаполнено(Цвет) Тогда
		Цвет = ОбщегоНазначения.СвойстваОбъекта(Ссылка,"000000072");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Цвет) Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат СтрЗаменить(Цвет.Код, " ", "");
	 
КонецФункции

Функция ПолучитьРазмер() Экспорт 
	
	РазмерС = ПолучитьРазм("000000099");
	Если РазмерС <> "" Тогда  
		Возврат РазмерС;
	Иначе
		
		РазмерС = ПолучитьРазм("000000129");
		Если РазмерС <> "" Тогда  
			Возврат РазмерС;
		Иначе
			Возврат ПолучитьРазм("000000127"); 
			
		КонецЕсли;
		
	КонецЕсли;
	
		
КонецФункции

функция ПолучитьРазм(Код) 
	
	ЭтоНК = ЭтоХарактеристикаНК();

	Если ЭтоНК Тогда
		Хар = Комплектующие_НК()[0].ХарактеристикаКомплектующей;
		Наим = Хар.Наименование;
	Иначе
		Хар = Ссылка;
		Наим = Наименование;
	КонецЕсли;

	СвойствоРазмер = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду(Код);
	ТабСвойства = ОбщегоНазначения.СвойстваЗначенияНоменклатура(СвойствоРазмер,Хар);

	Сост = ОбщегоНазначения.СоставныеПоРазделителю(Наим, ",");
	РазмерС = "";
	Для Каждого Стр Из Сост Цикл
		НайденоСвойство = ТабСвойства.Найти(Стр.Значение,"Значение");
		Если НЕ НайденоСвойство = Неопределено Тогда
			РазмерС = Стр.Значение;
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	
	Возврат РазмерС;
КонецФункции

функция ПолучитьЗначениеТкань() Экспорт  
	 Возврат ОбщегоНазначения.СвойстваОбъекта(Ссылка,"000000065");
КонецФункции

Функция ПолучитьКодТкани() Экспорт
	Ткань = ОбщегоНазначения.СвойстваОбъекта(Ссылка,"000000065");

	Если  Не ЗначениеЗаполнено(Ткань) Тогда 
		Возврат "";
	КонецЕсли;
	
	Код = СтрЗаменить(Ткань.Код, " ", "");
	Возврат СтрЗаменить(Код, "0", "");
	
КонецФункции

Функция ПолучитьСсылку() Экспорт
	СвойствоЦвет = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("000000069"); // Обычный цвет
	ТабСвойства = ОбщегоНазначения.СвойстваЗначенияНоменклатураЗн(СвойствоЦвет,Ссылка);
	
	Если ТабСвойства.Количество() = 0 Тогда
		СвойствоЦвет = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("000000072"); //2Цвет школьная
		ТабСвойства = ОбщегоНазначения.СвойстваЗначенияНоменклатураЗн(СвойствоЦвет,Ссылка);
	КонецЕсли;
	
	Значение =  ТабСвойства.Получить(0).Значение;
	ЦветТранс = Значение.Транслитирация;
	
	Если ЦветТранс = "" Тогда 
		 ЗначениеОбъект = Значение.ПолучитьОбъект();
		 ЗначениеОбъект.Транслитирация = ОбщегоНазначения.Транслитерация(Значение.НаименованиеРус);
		 ЗначениеОбъект.Записать();
		 ЦветТранс = ЗначениеОбъект.Транслитирация;		 
	 КонецЕсли;
	 
	 НоменклатураТранс = Владелец.Транслитирация;
	 
	 Если НоменклатураТранс = "" Тогда 
		ВладелецОбъект = Владелец.ПолучитьОбъект();
		ВладелецОбъект.Транслитирация = ОбщегоНазначения.Транслитерация(Владелец.НаименованиеПолноеРус);
		ВладелецОбъект.Записать();
		НоменклатураТранс = ВладелецОбъект.Транслитирация;
     КонецЕсли;

	Возврат "https://cvetkovtm.com/ua/" + НоменклатураТранс + "-" + ЦветТранс + "-" + Владелец.ПолучитьОбъект().КодБезНоликов() + "/?opt&calc";
	
КонецФункции

функция ПолучитьОтчетЗаСмену() Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОтчетПроизводстваЗаСменуПродукция.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОтчетПроизводстваЗаСмену.Продукция КАК ОтчетПроизводстваЗаСменуПродукция
	|ГДЕ
	|	ОтчетПроизводстваЗаСменуПродукция.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОтчетПроизводстваЗаСменуПродукция.Ссылка.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",Ссылка);
	
	Результат = Запрос.Выполнить().Выбрать();
    Если Результат.Следующий() Тогда
        Возврат Результат.Ссылка;
    Иначе
        Возврат Неопределено; // Возвращаем неопределенное значение, если ничего не найдено
    КонецЕсли;	
	
КонецФункции

Функция ПолучитьДиапазонИзготовления(Опт) Экспорт 
	
	Если ЭтоХарактеристикаНК() Тогда
		
		Комплектующие = Комплектующие_НК();
		
		СтруктураСроков = Новый Структура;
		СтруктураСроков.Вставить("ДатаПошиваНачало", Дата(1, 1, 1));
		СтруктураСроков.Вставить("ДатаПошиваКонец", Дата(1, 1, 1));
		
		Для Каждого Компл Из Комплектующие Цикл
			
			СтруктураСроков1 = Компл.ХарактеристикаКомплектующей
				.ПолучитьОбъект()
				.ПолучитьДатуИзготовления(Опт);
			
			Если ЗначениеЗаполнено(СтруктураСроков1) Тогда
				
				Если СтруктураСроков1.ДатаПошиваНачало > СтруктураСроков.ДатаПошиваНачало Тогда
					СтруктураСроков.ДатаПошиваНачало = СтруктураСроков1.ДатаПошиваНачало;
				КонецЕсли;
				
				Если СтруктураСроков1.ДатаПошиваКонец > СтруктураСроков.ДатаПошиваКонец Тогда
					СтруктураСроков.ДатаПошиваКонец = СтруктураСроков1.ДатаПошиваКонец;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если СтруктураСроков.ДатаПошиваНачало = Дата(1, 1, 1) Тогда
			Возврат "";
		КонецЕсли;
		
	Иначе 
		
		СтруктураСроков = ПолучитьДатуИзготовления(Опт);
		
		Если Не ЗначениеЗаполнено(СтруктураСроков) Тогда
			Возврат "";
		КонецЕсли;
		
	КонецЕсли;
	
	
	ДатаПошиваНачало = Формат(СтруктураСроков.ДатаПошиваНачало, "ДФ=dd.MM"); 
	ДатаПошиваКонец = Формат(СтруктураСроков.ДатаПошиваКонец, "ДФ=dd.MM");
	
	Если ДатаПошиваНачало = ДатаПошиваКонец Тогда
		Возврат ДатаПошиваНачало;
	Иначе 
		Возврат ДатаПошиваНачало + " - " + ДатаПошиваКонец;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДатуИзготовления(Опт) Экспорт 
	
	Если Владелец.ВидНоменклатуры.Код = "000000010"  Тогда
		
		Комплектующие = Комплектующие_НК();
		
		СтруктураСроков = Новый Структура;
		
		СтруктураСроков.Вставить("ДатаПошиваНачало", Дата(1,1,1));
		
		СтруктураСроков.Вставить("ДатаПошиваКонец", Дата(1,1,1));
		
		Для Каждого Компл Из Комплектующие Цикл
			
			
			СтруктураСроков1 = Компл.ХарактеристикаКомплектующей
			.ПолучитьОбъект()
			.ПолучитьДатуИзготовления(Опт);
			
			Если СтруктураСроков1 <> Неопределено Тогда
				
				// максимальная дата начала
				Если СтруктураСроков1.ДатаПошиваНачало 
					> СтруктураСроков.ДатаПошиваНачало Тогда
					
					СтруктураСроков.ДатаПошиваНачало =
					СтруктураСроков1.ДатаПошиваНачало;
					
				КонецЕсли;
				
				
				// максимальная дата конца
				Если СтруктураСроков1.ДатаПошиваКонец 
					> СтруктураСроков.ДатаПошиваКонец Тогда
					
					СтруктураСроков.ДатаПошиваКонец =
					СтруктураСроков1.ДатаПошиваКонец;
					
				КонецЕсли;
				
			КонецЕсли;
			
			
		КонецЦикла;
		
		Возврат СтруктураСроков;
		
	Иначе
		
		Ростовка = ПолучитьРостовку(Истина);
		
		Если Ростовка = Неопределено Тогда 
			Возврат Неопределено;
		КонецЕсли; 
		
		Склад = ПолучитьСкладРезерва(Опт);
		Если (Склад <> Неопределено И (Склад.Код = "000000026" ИЛИ Склад.Код = "000000128")) Тогда
			Возврат ПолучитьДатуСНеПошит(); 
		Иначе	
			Если Ростовка.ИгнорироватьНоль Тогда
				Если ЗначениеЗаполнено(Ростовка.ДатаПошиваНачало) Тогда
					
					Попытка
						
						ДатаПошиваНачало = Ростовка.ДатаПошиваНачало;
						ДатаПошиваКонец  = Ростовка.ДатаПошиваКонец;
						
						Если Не ЗначениеЗаполнено(ДатаПошиваКонец) Тогда
							ДатаПошиваКонец = ДатаПошиваНачало;
						КонецЕсли;
						
						Если ДатаПошиваКонец < ДатаПошиваНачало Тогда
							
							ЗаписьЖурналаРегистрации(
							"Некоректний діапазон пошиву. Характеристика: "
							+ Ссылка.Наименование
							+ ". Початок: "
							+ Формат(ДатаПошиваНачало, "ДФ=dd.MM.yyyy")
							+ ", кінець: "
							+ Формат(ДатаПошиваКонец, "ДФ=dd.MM.yyyy"),
							УровеньЖурналаРегистрации.Ошибка
							);
							
							// Меняем даты местами.
							ВременнаяДата = ДатаПошиваНачало;
							ДатаПошиваНачало = ДатаПошиваКонец;
							ДатаПошиваКонец = ВременнаяДата;
							
						КонецЕсли;
						
						СтруктураСроков = Новый Структура;
						СтруктураСроков.Вставить(
						"ДатаПошиваНачало",
						ДатаПошиваНачало
						);
						СтруктураСроков.Вставить(
						"ДатаПошиваКонец",
						ДатаПошиваКонец
						);
						
					Исключение
						
						ЗаписьЖурналаРегистрации(
						ОписаниеОшибки() + " " + Ссылка.Наименование,
						УровеньЖурналаРегистрации.Ошибка
						);
						
						Возврат Неопределено;
						
					КонецПопытки;
					
					Возврат СтруктураСроков;
					
				Иначе
					
					Если ЭтоХарактеристикаРучнойНК() Тогда
						
						Комплектующие = Комплектующие_НК();
						
						Если Комплектующие.Количество() = 0 Тогда
							Возврат Неопределено;
						КонецЕсли;
						
						Номенклатура =
						Комплектующие[0]
						.ХарактеристикаКомплектующей
						.Владелец;
						
					Иначе
						
						Номенклатура = Владелец;
						
					КонецЕсли;
					
					Крой1 = Номенклатура.РазмерыНовогоКроя1;
					Крой2 = Номенклатура.РазмерыНовогоКроя2;
					ТекущийРазмер = ПолучитьРазмер();
					
					СрокИсполнения = Неопределено;
					
					Если РазмерЕстьВКрое(Крой1, ТекущийРазмер) Тогда
						
						СрокИсполнения = Номенклатура.СрокИсполнения1;
						
					ИначеЕсли РазмерЕстьВКрое(Крой2, ТекущийРазмер) Тогда
						
						СрокИсполнения = Номенклатура.СрокИсполнения2;
						
					КонецЕсли;
					
					Если Не ЗначениеЗаполнено(СрокИсполнения) Тогда
						Возврат Неопределено;
					КонецЕсли;
					
					Попытка
						
						СтруктураСроков = Новый Структура;
						СтруктураСроков.Вставить(
						"ДатаПошиваНачало",
						СрокИсполнения
						);
						СтруктураСроков.Вставить(
						"ДатаПошиваКонец",
						СрокИсполнения + 60 * 60 * 24 * 3
						);
						
					Исключение
						
						ЗаписьЖурналаРегистрации(
						ОписаниеОшибки() + " " + Ссылка.Наименование,
						УровеньЖурналаРегистрации.Ошибка
						);
						
						Возврат Неопределено;
						
					КонецПопытки;
					
					Возврат СтруктураСроков;
					
				КонецЕсли;				
			Иначе	
			КонецЕсли;
		КонецЕсли;  
	КонецЕсли;
	
КонецФункции      

Функция ПолучитьДатуСНеПошит() Экспорт
	
	Характеристика = ПолучитьХарактеристикуДляПолученияДаты();
	
	Если Не ЗначениеЗаполнено(Характеристика) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОтчетПроизводстваЗаСменуПродукция.ДатаПошиваНачало КАК ДатаПошиваНачало,
	|	ОтчетПроизводстваЗаСменуПродукция.ДатаПошиваКонец КАК ДатаПошиваКонец,
	|	ОтчетПроизводстваЗаСменуПродукция.Ссылка.Дата КАК Дата
	|ИЗ
	|	Документ.ОтчетПроизводстваЗаСмену.Продукция КАК ОтчетПроизводстваЗаСменуПродукция
	|ГДЕ
	|	ОтчетПроизводстваЗаСменуПродукция.ХарактеристикаНоменклатуры =
	|		&ХарактеристикаНоменклатуры
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр(
		"ХарактеристикаНоменклатуры",
		Характеристика
	);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Не Результат.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДатаПошиваНачало = Результат.ДатаПошиваНачало;
	ДатаПошиваКонец  = Результат.ДатаПошиваКонец;
	
	Если Не ЗначениеЗаполнено(ДатаПошиваНачало)
		Или ДатаПошиваНачало = Дата(1, 1, 1) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	// У тебя было название "Плюс3", но фактически прибавлялось 2 дня.
	ТекущаяДатаПлюс3 =
		НачалоДня(ТекущаяДата())
		+ 60 * 60 * 24 * 3;
	
	Если ДатаПошиваНачало < ТекущаяДатаПлюс3 Тогда
		ДатаПошиваНачало = ТекущаяДатаПлюс3;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаПошиваКонец)
		Или ДатаПошиваКонец = Дата(1, 1, 1) Тогда
		
		ДатаПошиваКонец = ДатаПошиваНачало;
		
	ИначеЕсли ДатаПошиваКонец < ТекущаяДатаПлюс3 Тогда
		
		ДатаПошиваКонец = ТекущаяДатаПлюс3;
		
	КонецЕсли;
	
	// Ключевая защита: конец не может быть раньше начала.
	Если ДатаПошиваКонец < ДатаПошиваНачало Тогда
		
		ЗаписьЖурналаРегистрации(
			"Некоректний діапазон пошиву для характеристики "
			+ Строка(Характеристика)
			+ ". Початок: "
			+ Формат(ДатаПошиваНачало, "ДФ=dd.MM.yyyy")
			+ ", кінець: "
			+ Формат(ДатаПошиваКонец, "ДФ=dd.MM.yyyy")
			+ ". Дату завершення встановлено за датою початку.",
			УровеньЖурналаРегистрации.Предупреждение
		);
		
		ДатаПошиваКонец = ДатаПошиваНачало;
		
	КонецЕсли;
	
	Возврат Новый Структура(
		"ДатаПошиваНачало,ДатаПошиваКонец",
		ДатаПошиваНачало,
		ДатаПошиваКонец
	);
	
КонецФункции

функция ПолучимИнформациюПоРостовке() Экспорт
	
	
	Запрос = Новый Запрос;

	Запрос.Текст = "ВЫБРАТЬ
	               |	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика,
	               |	ВЫБОР
	               |		КОГДА основная.Ссылка ЕСТЬ NULL
	               |			ТОГДА неосновная.Ссылка
	               |		ИНАЧЕ основная.Ссылка
	               |	КОНЕЦ КАК Ростовка,
	               |	ХарактеристикиНоменклатуры.Владелец КАК Владелец
	               |ПОМЕСТИТЬ ВТРостовка
	               |ИЗ
	               |	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	               |		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			МАКСИМУМ(ГруппыХарактеристикХарактеристики.Ссылка) КАК Ссылка,
	               |			ГруппыХарактеристикХарактеристики.Характеристика КАК Характеристика
	               |		ИЗ
	               |			Справочник.ГруппыХарактеристик.Характеристики КАК ГруппыХарактеристикХарактеристики
	               |		ГДЕ
	               |			ГруппыХарактеристикХарактеристики.Ссылка.НеОсновная
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ГруппыХарактеристикХарактеристики.Характеристика) КАК неосновная
	               |		ПО ХарактеристикиНоменклатуры.Ссылка = неосновная.Характеристика
	               |		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			МАКСИМУМ(ГруппыХарактеристикХарактеристики.Ссылка) КАК Ссылка,
	               |			ГруппыХарактеристикХарактеристики.Характеристика КАК Характеристика
	               |		ИЗ
	               |			Справочник.ГруппыХарактеристик.Характеристики КАК ГруппыХарактеристикХарактеристики
	               |		ГДЕ
	               |			НЕ ГруппыХарактеристикХарактеристики.Ссылка.НеОсновная
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ГруппыХарактеристикХарактеристики.Характеристика) КАК основная
	               |		ПО ХарактеристикиНоменклатуры.Ссылка = основная.Характеристика
	               |ГДЕ
	               |	ХарактеристикиНоменклатуры.Владелец.ВидНоменклатуры.Код В (""000000010"", ""000000001"")
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ХарактеристикиНоменклатуры.Владелец.ВидНоменклатуры.Код = ""000000010""
	               |			ТОГДА ПолучимРостовкуКомплекта.Ростовка.ИНКоличество
	               |		ИНАЧЕ ПолучимРостовку.Ростовка.ИНКоличество
	               |	КОНЕЦ КАК ИНКоличество,
	               |	ВЫБОР
	               |		КОГДА ХарактеристикиНоменклатуры.Владелец.ВидНоменклатуры.Код = ""000000010""
	               |			ТОГДА ПолучимРостовкуКомплекта.Ростовка.ИгнорироватьНоль
	               |		ИНАЧЕ ПолучимРостовку.Ростовка.ИгнорироватьНоль
	               |	КОНЕЦ КАК ИгнорироватьНоль
	               |ПОМЕСТИТЬ общ
	               |ИЗ
	               |	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	               |		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ХарактеристикиНоменклатуры.Ссылка КАК Характеристика,
	               |			ВТРостовка.Ростовка КАК Ростовка
	               |		ИЗ
	               |			ВТРостовка КАК ВТРостовка
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	               |				ПО ВТРостовка.Характеристика = ХарактеристикиНоменклатуры.Ссылка) КАК ПолучимРостовку
	               |		ПО ХарактеристикиНоменклатуры.Ссылка = ПолучимРостовку.Характеристика
	               |		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.КомплектующиеНоменклатуры КАК КомплектующиеНоменклатуры
	               |			ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				ХарактеристикиНоменклатуры.Ссылка КАК Характеристика,
	               |				ВТРостовка.Ростовка КАК Ростовка
	               |			ИЗ
	               |				ВТРостовка КАК ВТРостовка
	               |					ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	               |					ПО ВТРостовка.Характеристика = ХарактеристикиНоменклатуры.Ссылка) КАК ПолучимРостовкуКомплекта
	               |			ПО КомплектующиеНоменклатуры.ХарактеристикаКомплектующей = ПолучимРостовкуКомплекта.Характеристика
	               |		ПО ХарактеристикиНоменклатуры.Ссылка = КомплектующиеНоменклатуры.ХарактеристикаНоменклатуры
	               |ГДЕ
	               |	ХарактеристикиНоменклатуры.Ссылка = &ХарактеристикаНоменклатуры
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МИНИМУМ(ВЫБОР
	               |			КОГДА общ.ИНКоличество = 0
	               |				ТОГДА 100
	               |			ИНАЧЕ общ.ИНКоличество
	               |		КОНЕЦ) КАК ИнКоличество,
	               |	МИНИМУМ(общ.ИгнорироватьНоль) КАК ИгнорироватьНоль
	               |ИЗ
	               |	общ КАК общ";
	 
	  Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", Ссылка);

	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	СтруктураРостовки = Новый Структура;
	СтруктураРостовки.Вставить("ИНКоличество", 0);
	СтруктураРостовки.Вставить("ИгнорироватьНоль", Ложь);
	
	Если Выборка.Следующий() Тогда
		
		СтруктураРостовки.ИНКоличество = Выборка.ИНКоличество;
		СтруктураРостовки.ИгнорироватьНоль = Выборка.ИгнорироватьНоль;
		
	КонецЕсли;
	
	Возврат СтруктураРостовки;
	 
	 
КонецФункции

функция РазмерЕстьВКрое(Крой,ТекущийРазмер)
	
	Если Не ПустаяСтрока(Крой) Тогда
				
		Размеры = ИзСтрокиВМассив(Крой,",");
				
		Для Каждого Разм из Размеры Цикл	
			Если Разм = ТекущийРазмер Тогда
		          Возврат Истина;				  
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат Ложь;
КонецФункции


функция ПолучитьХарактеристикуДляПолученияДаты() Экспорт 
	
	СкладРезерва = Справочники.Склады.ПустаяСсылка();
	ХарКа        = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	
	СхемаОпт = Справочники.СхемыРезервирования.НайтиПоНаименованию("Опт");
	
	СтрНоменклатуры = Новый Структура;
	СтрНоменклатуры.Вставить("Номенклатура", Владелец);
	СтрНоменклатуры.Вставить("Количество", 1);
	СтрНоменклатуры.Вставить("ХарактеристикаНоменклатуры", ХарКа);

	Если ЭтоХарактеристикаРучнойНК() Тогда		
		Комплектующие = Комплектующие_НК();
		
		Для Каждого комплектущая Из Комплектующие Цикл			
			Хар = комплектущая.ХарактеристикаКомплектующей;
			СтрНоменклатуры.ХарактеристикаНоменклатуры = Хар;
			СтрНоменклатуры.Номенклатура = Хар.Владелец;
			СкладРезерва = ОбщегоНазначения.СкладРезерваПолучить(СтрНоменклатуры, СхемаОпт);
			Если СкладРезерва.Качество.Код <> "000000001" Тогда
				Возврат Хар;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;	
			
	Возврат Ссылка;

КонецФункции

Функция ПолучитьСкладРезерва(Опт) Экспорт 
	
	СкладРезерва = Справочники.Склады.ПустаяСсылка();
	ХарКа = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	
	СхемаОпт = Справочники.СхемыРезервирования.НайтиПоНаименованию("Опт");
	СхемаРозн = Справочники.СхемыРезервирования.НайтиПоНаименованию("Розн");
	СхемаРезерва = ?(Опт, СхемаОпт, СхемаРозн);
	
	СтрНоменклатуры = Новый Структура;
	СтрНоменклатуры.Вставить("Номенклатура", Владелец);
	СтрНоменклатуры.Вставить("Количество", 1);
	СтрНоменклатуры.Вставить("ХарактеристикаНоменклатуры", ХарКа);

	Если ЭтоХарактеристикаРучнойНК() ИЛИ ЭтоХарактеристикаНК() Тогда		
		
		Комплектующие = Комплектующие_НК();
		
		// Проверяем, если хотя бы одна комплектующая не найдена/попала на плохой склад
		Для Каждого Комплектующая Из Комплектующие Цикл			
			
			ХарКа = Комплектующая.ХарактеристикаКомплектующей;
			
			СтрНоменклатуры.Номенклатура = ХарКа.Владелец;
			СтрНоменклатуры.ХарактеристикаНоменклатуры = ХарКа;
			
			СкладРезерва = ОбщегоНазначения.СкладРезерваПолучить(СтрНоменклатуры, СхемаРезерва);
			
			Если СкладРезерва = Неопределено
				ИЛИ СкладРезерва = Справочники.Склады.ПустаяСсылка()
				ИЛИ СкладРезерва.Код = "000000023" Тогда
				
				Возврат СкладРезерва;
				
			КонецЕсли;
			
		КонецЦикла;
		
		// Проверяем качество складов комплектующих
		Для Каждого Комплектующая Из Комплектующие Цикл			
			
			ХарКа = Комплектующая.ХарактеристикаКомплектующей;
			
			СтрНоменклатуры.Номенклатура = ХарКа.Владелец;
			СтрНоменклатуры.ХарактеристикаНоменклатуры = ХарКа;
			
			СкладРезерва = ОбщегоНазначения.СкладРезерваПолучить(СтрНоменклатуры, СхемаРезерва);
			
			Если СкладРезерва = Неопределено
				ИЛИ СкладРезерва = Справочники.Склады.ПустаяСсылка()
				ИЛИ СкладРезерва.Качество.Код <> "000000001" Тогда
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе 
		
		ХарКа = Ссылка;
		
	КонецЕсли;	
	
	СтрНоменклатуры.Номенклатура = ХарКа.Владелец;
	СтрНоменклатуры.ХарактеристикаНоменклатуры = ХарКа;
	
	Возврат ОбщегоНазначения.СкладРезерваПолучить(СтрНоменклатуры, СхемаРезерва);		
	
КонецФункции

Функция ИзСтрокиВМассив(НачальнаяСтрока,Разделитель) экспорт
    
    СтрокаПреобразованнаяВМногострочныйТекст     = СтрЗаменить(НачальнаяСтрока,Разделитель,Символы.ПС);
    ТекстовыйДокументИзСтроки                    = Новый ТекстовыйДокумент;
    Результат                                    = Новый Массив;
    ТекстовыйДокументИзСтроки.УстановитьТекст(СтрокаПреобразованнаяВМногострочныйТекст);
    Для СчетчикСтрок = 1 по ТекстовыйДокументИзСтроки.КоличествоСтрок() цикл
        Результат.Добавить(СокрЛП(ТекстовыйДокументИзСтроки.ПолучитьСтроку(СчетчикСтрок)));
    КонецЦикла;
    Возврат Результат;
    
КонецФункции

Функция ЦветХарактеристики(РусЯзык = Ложь, ПереводитьНазвание = Ложь) Экспорт
	СвойствоЦвет = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("000000069"); // Обычный цвет
	ТабСвойства = ОбщегоНазначения.СвойстваЗначенияНоменклатураЗн(СвойствоЦвет,Ссылка);
	
	ЦветС = ОбщегоНазначения.ПолучитьЗначениеСвойстваХаракетристики(ТабСвойства,Ссылка,РусЯзык,, ПереводитьНазвание);
	
	Если Не ЗначениеЗаполнено(ЦветС) Тогда
		СвойствоЦвет = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("000000072"); //2Цвет школьная
		ТабСвойства = ОбщегоНазначения.СвойстваЗначенияНоменклатураЗн(СвойствоЦвет,Ссылка);

		ЦветС = ОбщегоНазначения.ПолучитьЗначениеСвойстваХаракетристики(ТабСвойства,Ссылка,Не РусЯзык,,ПереводитьНазвание);
	КонецЕсли;
	Возврат СокрЛП(ЦветС);
	
КонецФункции

функция КодБезНоликов() Экспорт
	Возврат ОбщегоНазначения.УбратьНоликиСлева(Код);	
Конецфункции

функция ИдДляВыгрузки() Экспорт
	НоменклатураОбъект = Владелец.ПолучитьОбъект();
	КодБезНоливокНоменклатуры = НоменклатураОбъект.КодБезНоликов();	
	Возврат КодБезНоливокНоменклатуры + КодБезНоликов();  	
КонецФункции

Функция ПолучитьКоличествоКВыгрузкеСУчетомРазбитияРостовкок(ОстатокПоВсемСкладам = Неопределено, ГруппаСкладов = Неопределено) Экспорт
		

	Ростовка = ПолучитьРостовку(Истина);	
	
	Группа = ?(ГруппаСкладов=Неопределено,Справочники.Склады.НайтиПоКоду("000000053"),ГруппаСкладов); //Наши склады + реализация                
	МассивСкладов = Справочники.Склады.ПолучитьМассивСкладов(Группа); 
			
	Остаток = СвободныйОстаток(МассивСкладов);
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Характеристика");
	ТЗ.Колонки.Добавить("Остаток");
	ТЗ.Колонки.Добавить("Доступна");
	ОстатокРозница = 0;
	
	Если Ростовка <> Неопределено Тогда
		
		Для Каждого Стр Из Ростовка.Характеристики Цикл
			Характеристика = Стр.Характеристика;
			ХарактеристикаиОбъект = Характеристика.ПолучитьОбъект();
						
			Остаток = ХарактеристикаиОбъект.СвободныйОстаток(МассивСкладов);
														   
			НС = ТЗ.Добавить();
			НС.Характеристика = Характеристика;
			НС.Остаток = Остаток;//?(Остаток<0,0,Остаток);

			////// Розница
			//Если Характеристика = Ссылка Тогда
			//	Реализация = Справочники.Склады.НайтиПоКоду("000000037"); // Группа Реализация 
			//	МассРеализация = Справочники.Склады.ПолучитьМассивСкладов(Реализация);
			//
			//	ОстатокРозница = ХарактеристикаиОбъект.СвободныйОстаток(МассРеализация);
			//КонецЕсли;
						
		КонецЦикла;
		
		Мин = 1000; Макс = 0;
		Для Каждого Стр Из ТЗ Цикл
			Если Стр.Остаток > Макс Тогда
				Макс = Стр.Остаток;
			КонецЕсли;
			Если Стр.Остаток < Мин Тогда
				Мин = Стр.Остаток;
			КонецЕсли;
		КонецЦикла;
		
		МожноРаспаковатьРостовок = Ростовка.РаспаковатьРостовок;  // можно ли распаковать ростовки?
		Для Каждого Стр Из ТЗ Цикл
			Если НЕ Стр.Характеристика = Ссылка Тогда Продолжить; КонецЕсли;
			ММ = Макс-Мин;
			Если НЕ ((Макс-Мин)=0 И МожноРаспаковатьРостовок=0) И НЕ Мин<0 Тогда
				Если Мин=0 Тогда
					МВ = 0;
				ИначеЕсли Мин = Макс И МожноРаспаковатьРостовок>0 Тогда
					МВ = Мин-МожноРаспаковатьРостовок;
					Если МВ<0 Тогда
						МВ = 0;
					КонецЕсли;
				Иначе
					Если ММ>=МожноРаспаковатьРостовок Тогда
						МВ = Мин;
					Иначе
						МВ = Макс-МожноРаспаковатьРостовок; 
					КонецЕсли;
				КонецЕсли;
				
				//анализируем
				Если Стр.Остаток>МВ Тогда
					Возврат Стр.Остаток; //+ ОстатокРозница; // -МВ
				Иначе
					Возврат 0;// + ОстатокРозница;
				КонецЕсли;
			Иначе
				Возврат 0; //+ ОстатокРозница; 
			КонецЕсли;
		КонецЦикла;
	Иначе
		Попытка
			Возврат Остаток;
		Исключение
			Возврат 0;
		КонецПопытки;
	КонецЕсли;
	
КонецФункции

функция ПолучитьЦену(ТипЦены, Дата = Неопределено) Экспорт
	
	Дата = ?(Дата = Неопределено,ТекущаяДата(),Дата); 
	
	Если ЭтоНаборКомплектРучной() Тогда
			
		Цена = 0;
			
		Комлектующие = Комплектующие_НК();
			
		Для Каждого СтрокаТЗ Из Комлектующие Цикл
			
			ЦенаКомплекта = Ценообразование.ПолучитьЦенуНоменклатуры(СтрокаТЗ.Комплектующая, СтрокаТЗ.ХарактеристикаКомплектующей, ТипЦены, Дата);
			ЦенаКомплекта = ?(ЦенаКомплекта = Неопределено,0, ЦенаКомплекта);
			Цена = Цена + СтрокаТЗ.Количество * ЦенаКомплекта;
				
		КонецЦикла;
			
	Иначе
			
		Цена = Ценообразование.ПолучитьЦенуНоменклатуры(Владелец, Ссылка, ТипЦены, Дата);
			
	КонецЕсли;
	
	Возврат Цена;	
	
КонецФункции

функция ПолучитьЦенуПервую(ТипЦены, Наценка = Неопределено) Экспорт 
	
	Дата = ?(Дата = Неопределено,ТекущаяДата(),Дата);
	
	Если ЭтоНаборКомплектРучной() Тогда
			
		Цена = 0;
			
		Комлектующие = Комплектующие_НК();
			
		Для Каждого СтрокаТЗ Из Комлектующие Цикл
				
			Цена = Цена + СтрокаТЗ.Количество * Ценообразование.ПолучитьЦенуНоменклатуры(СтрокаТЗ.Комплектующая, СтрокаТЗ.ХарактеристикаКомплектующей, ТипЦены, Дата,,,,,,,,Истина);
				
		КонецЦикла;
			
	Иначе
			
		Цена = Ценообразование.ПолучитьЦенуНоменклатуры(Владелец, Ссылка, ТипЦены, Дата,,,,,,,,Истина, Наценка);
			
	КонецЕсли;
	
	Возврат ?(Цена = 0,1,Цена);	
конецФункции

 

функция ПолучитьСсылкуСайта() экспорт 
			Цвет = ПолучитьЗначениеЦвета();
					
		Если НЕ ЗначениеЗаполнено(Цвет.Транслитирация) Тогда 
			Если ЗначениеЗаполнено(Цвет.НаименованиеРус) Тогда 
				ЦветНаименование = Цвет.НаименованиеРус;
			Иначе   
				ЦветНаименование = Цвет.Наименование;
			КонецЕсли;
				
			Транслитирация = ОбщегоНазначения.Транслитерация(ЦветНаименование);
			ЦветОбъект =Цвет.ПолучитьОбъект();
			ЦветОбъект.Транслитирация = Транслитирация;
			ЦветОбъект.Записать(); 
			Цвет = Транслитирация; 
		Иначе
			Цвет = Цвет.Транслитирация;
		КонецЕсли;
	
		Возврат "https://cvetkovtm.com/ru/" + Владелец.Транслитирация + "-" + Цвет +"-" + Владелец.ПолучитьОбъект().КодБезНоликов()+"/";
КонецФункции  
 
 
функция ОткрытьСайт() экспорт 
	Если ЭтоНаборКомплектРучной() Тогда
		Цвет = ПолучитьЗначениеЦвета();
					
		Если НЕ ЗначениеЗаполнено(Цвет.Транслитирация) Тогда 
			Если ЗначениеЗаполнено(Цвет.НаименованиеРус) Тогда 
				ЦветНаименование = Цвет.НаименованиеРус;
			Иначе   
				ЦветНаименование = Цвет.Наименование;
			КонецЕсли;
				
			Транслитирация = ОбщегоНазначения.Транслитерация(ЦветНаименование);
			ЦветОбъект =Цвет.ПолучитьОбъект();
			ЦветОбъект.Транслитирация = Транслитирация;
			ЦветОбъект.Записать(); 
			Цвет = Транслитирация; 
		Иначе
			Цвет = Цвет.Транслитирация;
		КонецЕсли;
	
		ЗапуститьПриложение("https://cvetkovtm.com/ru/" + Владелец.Транслитирация + "-" + Цвет +"-" + Владелец.ПолучитьОбъект().КодБезНоликов()+"/");
	Иначе 
       ОткрытьСайтОпт()
	 КонецЕсли;	
 КонецФункции  
 
 Функция ЭтоНаборКомплектРучной() Экспорт  
	 Возврат  Владелец.ВидНоменклатуры.Код = "000000010";
 КонецФункции
 

функция ОткрытьСайтОпт() Экспорт 
	
	Если ЭтоНаборКомплектРучной() = Истина Тогда
		Ном = Ссылка;
	Иначе 	
		Запрос = Новый Запрос;
		Запрос.Текст = 

		  "ВЫБРАТЬ
		 |	Номенклатура.Ссылка КАК Ссылка
		 |ИЗ
		 |	Справочник.Номенклатура КАК Номенклатура
		 |ГДЕ
		 |	Номенклатура.Код = &Код";
		
		Запрос.УстановитьПараметр("Код", Владелец.НК);	
		Ном = Запрос.Выполнить().Выбрать().Ссылка;

			
	КонецЕсли;
	Цвет = ПолучитьЗначениеЦвета();
	
	
	Если НЕ ЗначениеЗаполнено(Цвет.Транслитирация) Тогда
		Если ЗначениеЗаполнено(Цвет.НаименованиеРус) Тогда 
			ЦветНаименование = Цвет.НаименованиеРус;
		Иначе   
			ЦветНаименование = Цвет.Наименование;
		КонецЕсли;
		
		Транслитирация = ОбщегоНазначения.Транслитерация(ЦветНаименование);		ЦветОбъект = Цвет.ПолучитьОбъект();
		ЦветОбъект.Транслитирация = Транслитирация;
		ЦветОбъект.Записать(); 
		Цвет = Транслитирация; 
	Иначе
		Цвет = Цвет.Транслитирация;
	КонецЕсли;
		
	ЗапуститьПриложение("https://cvetkovtm.com/ru/" + Владелец.Транслитирация + "-" + Цвет +"-" + Владелец.ПолучитьОбъект().КодБезНоликов()+"/?opt");   	
	
КонецФункции
